Repository: ShevchukOleg/Angular-v11-i18n-practice
Catalog: src/translate/messages.*.xlf
Languages: fr, ru

source: Site name
fr: Nom du site
ru: Имя сайта

source: English
fr: Anglais
ru: Ангдийский

source: Franch
fr: Français
ru: Французский

source: Ukrainian
fr: Ukrainienne
ru: Украинский

source: Russian
fr: Russe
ru: Русский

# articleTitle
source: US cyber-attack: US energy department confirms it was hit by Sunburst hack
fr: Cyber-attaque américaine: le département américain de l'énergie confirme qu'il a été touché par le piratage de Sunburst
ru: Кибератака США: министерство энергетики США подтвердило, что на него взломали Sunburst

source: cyber attack
fr: cyber-attaque
ru: кибератака

source: The FBI is among those investigating the hacking campaign
fr: Le FBI fait partie de ceux qui enquêtent sur la campagne de piratage informatique
ru: ФБР среди тех, кто расследует хакерскую кампанию.

# articleSubTitle
source: The US energy department is the latest agency to confirm it has been breached in what is being described as the worst-ever hack on the US government.
fr: Le département américain de l'énergie est la dernière agence à confirmer qu'il a été violé dans ce qui est décrit comme le pire piratage jamais réalisé contre le gouvernement américain.
ru: Министерство энергетики США стало последним агентством, подтвердившим, что его взломали в ходе того, что описывается как худшая в истории взлома правительства США.

source: The department is responsible for managing US nuclear weapons, but said the arsenal's security had not been compromised. Tech giant Microsoft also said on Thursday that it had found malicious software in its systems. Many suspect the Russian government is responsible. It has denied any role. The US treasury and commerce departments are among the other targets of the sophisticated, months-long breach, which was first acknowledged by officials on Sunday.
fr: Le département est responsable de la gestion des armes nucléaires américaines, mais a déclaré que la sécurité de l'arsenal n'avait pas été compromise. Le géant de la technologie Microsoft a également déclaré jeudi avoir trouvé des logiciels malveillants dans ses systèmes. Beaucoup soupçonnent le gouvernement russe d'en être responsable. Il a nié tout rôle. Les services du Trésor et du Commerce des États-Unis sont parmi les autres cibles de la brèche sophistiquée qui dure depuis des mois, qui a été reconnue pour la première fois par les responsables dimanche.
ru: Управление отвечает за управление ядерным оружием США, но заявило, что безопасность арсенала не была нарушена. Технический гигант Microsoft также заявил в четверг, что обнаружил в своих системах вредоносное ПО. Многие подозревают, что ответственность за это несет правительство России. Он отрицал какую-либо роль. Казначейство и министерство торговли США являются одной из других целей изощренного, продолжавшегося несколько месяцев, взлома, о котором официальные лица впервые заявили в воскресенье.

source: How has the US government responded?
fr: Comment le gouvernement américain a-t-il réagi?
ru: Как отреагировало правительство США?

source: President Donald Trump is yet to comment on the cyber-attacks. Meanwhile, US President-elect Joe Biden has vowed to make cyber-security a "top priority" of his administration. "We need to disrupt and deter our adversaries from undertaking significant cyber-attacks in the first place," he said. "We will do that by, among other things, imposing substantial costs on those responsible for such malicious attacks, including in coordination with our allies and partners." America's top cyber agency, the Cybersecurity and Infrastructure Agency (Cisa), gave a stark warning on Thursday, saying that addressing the intrusion would be "highly complex and challenging". It said "critical infrastructure" had been damaged, federal agencies and private sector companies compromised, and that the damage posed a "grave threat".
fr: Le président Donald Trump n'a pas encore commenté les cyber-attaques. Pendant ce temps, le président élu américain Joe Biden s'est engagé à faire de la cybersécurité une «priorité absolue». de son administration. "Nous devons interrompre et dissuader nos adversaires de mener des cyberattaques importantes en premier lieu", " il a dit. «Nous y parviendrons, entre autres, en imposant des coûts substantiels aux responsables de telles attaques malveillantes, y compris en coordination avec nos alliés et partenaires.» La principale cyber-agence américaine, la Cybersecurity and Infrastructure Agency (Cisa), a lancé un avertissement sévère jeudi, affirmant que lutter contre l'intrusion serait `` très complexe et difficile ''. Il a dit «infrastructure critique»; avaient été endommagés, des agences fédérales et des entreprises du secteur privé compromises et que les dégâts constituaient une «menace grave».
ru: Президент Дональд Трамп пока не прокомментировал кибератаки. Между тем избранный президент США Джо Байден пообещал сделать кибербезопасность «главным приоритетом». его администрации. «В первую очередь нам нужно помешать и удержать наших противников от проведения серьезных кибератак», - сказал он. он сказал. «Мы сделаем это, среди прочего, наложив существенные расходы на тех, кто несет ответственность за такие злонамеренные атаки, в том числе в координации с нашими союзниками и партнерами». Ведущее кибер-агентство Америки, Агентство кибербезопасности и инфраструктуры (Cisa), сделало в четверг резкое предупреждение, заявив, что противодействие вторжению будет "очень сложным и трудным". В нем говорилось: «Критическая инфраструктура»; был нанесен ущерб, федеральные агентства и компании частного сектора скомпрометированы, и этот ущерб представляет собой "серьезную угрозу".

source: SolarWinds: Why the Sunburst hack matters
fr: SolarWinds: Pourquoi le hack Sunburst est important

source: More US government agencies hacked
fr: Davantage d'agences gouvernementales américaines piratées
ru: Взломано больше правительственных агентств США

source: The hack began in at least March 2020, and those responsible had "demonstrated patience, operational security, and complex tradecraft", the Cisa said. The agency did not identify what information had been stolen or exposed. Addressing the attack on the energy department, spokeswoman Shaylyn Hynes confirmed that it was responding to a cyber breach but said "the malware has been isolated to business networks only". She said security functions at the National Nuclear Security Administration (NNSA), which oversees US nuclear weapons, had not been affected.
fr: Le piratage a commencé au moins en mars 2020, et les responsables avaient `` fait preuve de patience, de sécurité opérationnelle et de savoir-faire complexe '', a déclaré la Cisa. L'agence n'a pas identifié quelles informations avaient été volées ou révélées. Abordant l'attaque contre le département de l'énergie, la porte-parole Shaylyn Hynes a confirmé qu'elle répondait à une cyber-violation, mais a déclaré que `` le malware a été isolé uniquement sur les réseaux d'entreprise ''. Elle a déclaré que les fonctions de sécurité de la National Nuclear Security Administration (NNSA), qui supervise les armes nucléaires américaines, n'avaient pas été affectées.
ru: Взлом начался как минимум в марте 2020 года, и ответственные за это «продемонстрировали терпение, операционную безопасность и сложную торговлю», сообщает Cisa. Агентство не установило, какая информация была украдена или разоблачена. Обращаясь к атаке на министерство энергетики, пресс-секретарь Шейлин Хайнс подтвердила, что оно реагировало на кибербезопасность, но заявила, что «вредоносная программа была изолирована только для бизнес-сетей». Она сказала, что функции безопасности в Национальном управлении ядерной безопасности (NNSA), которое контролирует ядерное оружие США, не пострадали.

# FeedbackTitle
source: Please leave feedback
fr: Veuillez laisser des commentaires
ru: Пожалуйста, оставьте отзыв

source: Your name
fr: Votre nom
ru: Ваше имя

source: Your comment
fr: Votre commentaire
ru: Ваш комментарий

source: Vote
fr: Avis
ru: Мнение
